tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "romkatv/powerlevel10k"
tap "heroku/brew"
tap "http4k/tap"
tap "aws/tap"
tap "AdoptOpenJDK/openjdk"

# machine
brew "act"
brew "antigen"
brew "chruby"
brew "coreutils"
brew "dos2unix"
brew "fd"
brew "gpg"
brew "htop"
brew "httpstat"
brew "imagemagick"
brew "jq"
brew "just"
brew "mas"
brew "mkcert"
brew "rename"
brew "ruby-install"
brew "powerlevel10k"
brew "watchexec"
brew "xz"
brew "zsh"

# languages
brew "jenv"
brew "node"
brew "yarn"
brew "pnpm"
brew "openjdk@17"

# cloudnative
brew "awscli"
brew "heroku"
brew "http4k"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "pulumi"
brew "stern"

# machine
cask "1password"
cask "authy"
cask "calibre"
cask "discord"
cask "dropbox"
cask "evernote"
cask "figma"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "jetbrains-toolbox"
cask "jiggler"
cask "keybase"
cask "keystore-explorer"
cask "microsoft-office"
cask "iterm2"
cask "nordvpn"
cask "obs"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "vlc"
cask "zoom"

# containers
cask "docker"

# languages
cask "temurin11"
cask "temurin17"
